# pandas의 기본 연산 - DataFrame 2

In [1]:
import pandas as pd

In [4]:
a = {'이름' : ['홍길동', '사람 1', '사람 2'], '나이' : [20, 30, 25]}

In [5]:
df1 = pd.DataFrame(a)

In [6]:
df1

     이름  나이
0   홍길동  20
1  사람 1  30
2  사람 2  25

In [16]:
b = {'이름' : ['홍길동', '사람 1', '사람 2'], '도시' : ['서울', '서울', '대전']}

In [17]:
df2 = pd.DataFrame(b)

In [18]:
df2

     이름  도시
0   홍길동  서울
1  사람 1  서울
2  사람 2  대전

### 데이터프레임 합병 : merge()

In [19]:
df = pd.merge(left = df1,  # 왼쪽은 df1
              right = df2,  # 오른쪽은 df2
              how = 'left',  # 옆으로 붙이기
              left_on = '이름',  # 왼쪽 기준 열
              right_on = '이름')  # 오른쪽 기준 열

In [20]:
df

     이름  나이  도시
0   홍길동  20  서울
1  사람 1  30  서울
2  사람 2  25  대전

### 조건 처리

In [21]:
x1 = (df['도시'] == '서울')  # 도시 열의 값이 '서울'인 경우

In [22]:
df[x1]

     이름  나이  도시
0   홍길동  20  서울
1  사람 1  30  서울

In [23]:
x2 = (df['도시'] != '서울')  # 도시 열의 값이 '서울'이 아닌 경우

In [24]:
df[x2]

     이름  나이  도시
2  사람 2  25  대전

In [25]:
x3 = (df['나이'] < 30)

In [26]:
df[x3]

     이름  나이  도시
0   홍길동  20  서울
2  사람 2  25  대전

In [27]:
x4 = (df['도시'] == '서울') & (df['나이'] < 30)  # and

In [28]:
df[x4]

    이름  나이  도시
0  홍길동  20  서울

In [29]:
x5 = (df['도시'] == '서울') | (df['나이'] < 30)  # or

In [30]:
df[x5]

     이름  나이  도시
0   홍길동  20  서울
1  사람 1  30  서울
2  사람 2  25  대전